blueskycoco/rt-thread/bsp/tm4c129x/applications/con_common.c
}
#if CONFIG_BIN
char *send_out(int dev,int cmd,int *lenout)
{
	#if 0
	unsigned char config_local_ip[4+7]				={0xF5,0x8A,0x00,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*local ip*/
	unsigned char config_socket0_local_port[2+7]	={0xF5,0x8A,0x01,0xff,0xff,0x26,0xfa,0x00,0x00};/*local port0*/
	unsigned char config_socket1_local_port[2+7]	={0xF5,0x8A,0x02,0xff,0xff,0x26,0xfa,0x00,0x00};/*local port1*/
	unsigned char config_socket2_local_port[2+7]	={0xF5,0x8A,0x03,0xff,0xff,0x26,0xfa,0x00,0x00};/*local port2*/
	unsigned char config_socket3_local_port[2+7]	={0xF5,0x8A,0x04,0xff,0xff,0x26,0xfa,0x00,0x00};/*local port3*/
	unsigned char config_sub_msk[4+7]				={0xF5,0x8A,0x05,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*sub msk*/
	unsigned char config_gw[4+7]					={0xF5,0x8A,0x06,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*gw*/
	unsigned char config_mac[6+7]					={0xF5,0x8A,0x07,0xff,0xff,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*mac*/
	unsigned char config_socket0_ip[4+7]			={0xF5,0x8A,0x08,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 0 ip*/
	unsigned char config_socket1_ip[4+7]			={0xF5,0x8A,0x09,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 1 ip*/
	unsigned char config_socket2_ip[4+7]			={0xF5,0x8A,0x0a,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 2 ip*/
	unsigned char config_socket3_ip[4+7]			={0xF5,0x8A,0x0b,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 3 ip*/
	unsigned char config_socket0_ip6[64+7]			={0xF5,0x8A,0x0c,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 0 ip6*/
	unsigned char config_socket1_ip6[64+7]			={0xF5,0x8A,0x0d,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 1 ip6*/
	unsigned char config_socket2_ip6[64+7]			={0xF5,0x8A,0x0e,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 2 ip6*/
	unsigned char config_socket3_ip6[64+7]			={0xF5,0x8A,0x0f,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 3 ip6*/
	unsigned char config_socket0_remote_port[2+7]	={0xF5,0x8A,0x10,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 0 port*/
	unsigned char config_socket1_remote_port[2+7]	={0xF5,0x8A,0x11,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 1 port*/
	unsigned char config_socket2_remote_port[2+7]	={0xF5,0x8A,0x12,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 2 port*/
	unsigned char config_socket3_remote_port[2+7]	={0xF5,0x8A,0x13,0xff,0xff,0x26,0xfa,0x00,0x00};/*socket 3 port*/
	unsigned char config_net_protol0[1+7]			={0xF5,0x8A,0x14,0xff,0x26,0xfa,0x00,0x00};/*protol0*/
	unsigned char config_net_protol1[1+7]			={0xF5,0x8A,0x15,0xff,0x26,0xfa,0x00,0x00};/*protol1*/
	unsigned char config_net_protol2[1+7]			={0xF5,0x8A,0x16,0xff,0x26,0xfa,0x00,0x00};/*protol2*/
	unsigned char config_net_protol3[1+7]			={0xF5,0x8A,0x17,0xff,0x26,0xfa,0x00,0x00};/*protol3*/
	unsigned char config_socket_mode0[1+7]			={0xF5,0x8A,0x18,0xff,0x26,0xfa,0x00,0x00};/*server mode0*/
	unsigned char config_socket_mode1[1+7]			={0xF5,0x8A,0x19,0xff,0x26,0xfa,0x00,0x00};/*server mode1*/
	unsigned char config_socket_mode2[1+7]			={0xF5,0x8A,0x1a,0xff,0x26,0xfa,0x00,0x00};/*server mode2*/
	unsigned char config_socket_mode3[1+7]			={0xF5,0x8A,0x1b,0xff,0x26,0xfa,0x00,0x00};/*server mode3*/
	unsigned char config_uart_baud0[1+7]			={0xF5,0x8A,0x1c,0xff,0x26,0xfa,0x00,0x00};/*uart baud*/
	unsigned char config_uart_baud1[1+7]			={0xF5,0x8A,0x1d,0xff,0x26,0xfa,0x00,0x00};/*uart baud*/
	unsigned char config_uart_baud2[1+7]			={0xF5,0x8A,0x1e,0xff,0x26,0xfa,0x00,0x00};/*uart baud*/
	unsigned char config_uart_baud3[1+7]			={0xF5,0x8A,0x1f,0xff,0x26,0xfa,0x00,0x00};/*uart baud*/
	unsigned char config_local_ip6[64+7]			={0xF5,0x8A,0x20,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*local ip6*/
	unsigned char config_tcp0[1+7]					={0xF5,0x8A,0x21,0xff,0x26,0xfa,0x00,0x00};/*protol0*/
	unsigned char config_tcp1[1+7]					={0xF5,0x8A,0x22,0xff,0x26,0xfa,0x00,0x00};/*protol1*/
	unsigned char config_tcp2[1+7]					={0xF5,0x8A,0x23,0xff,0x26,0xfa,0x00,0x00};/*protol2*/
	unsigned char config_tcp3[1+7]					={0xF5,0x8A,0x24,0xff,0x26,0xfa,0x00,0x00};/*protol3*/
	#endif
	char *ptr=NULL;
	int crc=0,i=0,len;
	char *p=NULL;
	switch(cmd)
	{
		case 0:
			{
				ptr=config_local_ip;
				p=g_conf.local_ip;
				ptr[3]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[4]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[5]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[6]=atoi(p);
				len=4;
			}
			break;
		case 1:
			{
				if(dev==(cmd-1))
				ptr=config_socket0_local_port;
			}
		case 2:
			{
				if(dev==(cmd-1))
				ptr=config_socket1_local_port;
			}
		case 3:
			{
				if(dev==(cmd-1))
				ptr=config_socket2_local_port;
			}
		case 4:
			{
				if(dev==(cmd-1))
					ptr=config_socket3_local_port;
				if(ptr!=NULL)
				{
					ptr[3]=(g_conf.local_port[cmd-1]>>8)&0xff;
					ptr[4]=g_conf.local_port[cmd-1]&0xff;
					len=2;
				}				
			}			
			break;
		case 5:
			{
				ptr=config_sub_msk;
				p=g_conf.sub_msk;
				ptr[3]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[4]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[5]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[6]=atoi(p);
				len=4;
			}
			break;
		case 6:
			{
				ptr=config_gw;
				p=g_conf.gw;
				ptr[3]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[4]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[5]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[6]=atoi(p);
				len=4;
			}
			break;
		case 7:
			{
				ptr=config_mac;				
				p=g_conf.mac;
				ptr[3]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[4]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[5]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[6]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[7]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[8]=atoi(p);
				len=6;
			}
			break;	
		case 8:
			if(dev==(cmd-8))				
			ptr=config_socket0_ip;
		case 9:
			if(dev==(cmd-8))
			ptr=config_socket1_ip;
		case 10:
			if(dev==(cmd-8))
			ptr=config_socket2_ip;
		case 11:
			{
				if(dev==(cmd-8))
				ptr=config_socket3_ip;
				if(ptr!=NULL)
				{
					p=g_conf.remote_ip[cmd-8];
					ptr[3]=atoi(p);
					while(*p!='.')
						p++;
					p++;
					ptr[4]=atoi(p);
					while(*p!='.')
						p++;
					p++;
					ptr[5]=atoi(p);
					while(*p!='.')
						p++;
					p++;
					ptr[6]=atoi(p);
					len=4;
				}
			}
			break;
		case 12:
			if(dev==(cmd-12))
			ptr=config_socket0_ip6;
		case 13:
			if(dev==(cmd-12))
			ptr=config_socket1_ip6;
		case 14:
			if(dev==(cmd-12))
			ptr=config_socket2_ip6;
		case 15:
			{
				if(dev==(cmd-12))
				ptr=config_socket3_ip6;
				if(ptr!=NULL)
				{
					p=g_conf.remote_ip6[cmd-12];
					for(i=0;i<sizeof(g_conf.remote_ip6[cmd-12]);i++)
						ptr[3+i]=p[i];
					len=64;
				}
			}
			break;
		case 16:
			if(dev==(cmd-16))
			ptr=config_socket0_remote_port;
		case 17:
			if(dev==(cmd-16))
			ptr=config_socket1_remote_port;
		case 18:
			if(dev==(cmd-16))
			ptr=config_socket2_remote_port;
		case 19:
			{
				if(dev==(cmd-16))
					ptr=config_socket3_remote_port;
				if(ptr!=NULL)
				{
					ptr[3]=(g_conf.remote_port[cmd-16]>>8)&0xff;
					ptr[4]=g_conf.remote_port[cmd-16]&0xff;
					len=2;
				}
			}
			break;
		case 20:
			if(dev==(cmd-20))
			ptr=config_net_protol0;
		case 21:
			if(dev==(cmd-20))
			ptr=config_net_protol1;
		case 22:
			if(dev==(cmd-20))
			ptr=config_net_protol2;
		case 23:
			{
				if(dev==(cmd-20))
				ptr=config_net_protol3;
				if(ptr!=NULL)
				{
					ptr[3]=(g_conf.config[cmd-20]&CONFIG_IPV6)?1:0;
					len=1;
				}
			}
			break;
		case 24:
			if(dev==(cmd-24))
			ptr=config_socket_mode0;
		case 25:
			if(dev==(cmd-24))
			ptr=config_socket_mode1;
		case 26:
			if(dev==(cmd-24))
			ptr=config_socket_mode2;
		case 27:
			{
				if(dev==(cmd-24))
				ptr=config_socket_mode3;
				if(ptr!=NULL)
				{
					ptr[3]=(g_conf.config[cmd-24]&CONFIG_SERVER)?1:0;
					len=1;
				}
			}
			break;
		case 28:
			if(dev==(cmd-28))
			ptr=config_uart_baud0;
		case 29:
			if(dev==(cmd-28))
			ptr=config_uart_baud1;
		case 30:
			if(dev==(cmd-28))
			ptr=config_uart_baud2;
		case 31:
			{
				if(dev==(cmd-28))
				ptr=config_uart_baud3;
				if(ptr!=NULL)
				{
					ptr[3]=g_conf.config[cmd-28]>>3;
					len=1;
				}
			}
			break;
		case 32:
			{
				ptr=config_local_ip6;
				if(ptr!=NULL)
				{
					p=g_conf.local_ip6;
					for(i=0;i<sizeof(g_conf.local_ip6);i++)
						ptr[3+i]=p[i];
					len=64;
				}
			}
			break;
		case 33:
			if(dev==(cmd-33))
			ptr=config_tcp0;
		case 34:
			if(dev==(cmd-33))
			ptr=config_tcp1;
		case 35:
			if(dev==(cmd-33))
			ptr=config_tcp2;
		case 36:
			{
				if(dev==(cmd-33))
				ptr=config_tcp3;
				if(ptr!=NULL)
				{
					ptr[3]=(g_conf.config[cmd-33]&CONFIG_TCP)?1:0;
					len=1;
				}
			}
			break;

		default:
			break;
	}
	if(ptr!=NULL)
	{
		ptr[0]=0xf5;ptr[1]=0x8b;ptr[2]=cmd;
		ptr[len+3]=0x26;ptr[len+4]=0xfa;
		for(i=0;i<len+5;i++)
			crc=crc+ptr[i];
		ptr[len+5]=(crc>>8)&0xff;
		ptr[len+6]=(crc)&0xff;
		*lenout=len+7;
	}
	return ptr;
}
void common_rw_config(int dev)
{

	rt_uint8_t buf[65];
	rt_uint8_t i=0,delay=0;	
	int data_len,crc_len,longlen=0;
	unsigned char crc[2];
	char ch;	
	int lenout;
	rt_uint8_t len=0,param;
	enum STATE_OP state=GET_F5;
	DBG("enter common_rw_config\r\n");
	rt_uint8_t *ptr=(rt_uint8_t *)buf;
	configlock();
	while(1)
	{
		if(rt_device_read(common_dev[dev], 0, &ch, 1)==1)
		{
		if(ch==0xf5 && state==GET_F5)
		{
			DBG("GET_F5\r\n");
			state=GET_8A_8B;
		}
		else if(ch==0x8a && state==GET_8A_8B)
		{
			DBG("GET_8A\r\n");
			data_len=0;
			longlen=0;
			state=GET_DATA;
		}
		else if(ch==0x8b && state==GET_8A_8B)
		{
			DBG("GET_8B\r\n");
			rt_device_read(common_dev[dev], 0, &ch, 1);
			DBG("GET %d\r\n",ch);
			char *tmp=send_out(dev,ch,&lenout);
			if(tmp!=NULL)
			{
				int ii=0;
				for(ii=0;ii<lenout;ii++)
					DBG("%2x ",tmp[ii]);
				rt_device_write(common_dev[dev], 0, (void *)tmp, lenout);
			}
			else
				DBG("some error\r\n");
			break;
		}
		else if(state==GET_DATA)
		{	
			DBG("GET_DATA %2x\r\n",ch);
			*(ptr+data_len)=ch;
			if(data_len==0)
			{
				if(ch==0x0c || ch==0x0d || ch==0x0e || ch==0x0f || ch==0x20)
					state=GET_LEN;
 			}
			else
			{
				if(ch==0x26&&(data_len>longlen))
					state=GET_FA;
 			}
			
			data_len++;
		}
		else if(state==GET_LEN)
		{
			DBG("GET_LEN %2x\r\n",ch);
			longlen=ch;
			state=GET_DATA;
		}
		else if(ch==0xfa && state==GET_FA)
		{
			DBG("GET_FA\r\n");
			data_len--;
			crc_len=0;
			state=GET_CHECSUM;
		}
		else if(state==GET_CHECSUM)
		{
			if(crc_len!=1)
			{
				crc[crc_len++]=ch;
				DBG("GET_SUM %2x\r\n",ch);
			}
			else
			{
				crc[crc_len++]=ch;
				DBG("GET_SUM %2x\r\n",ch);
				//verify checksum
				int verify=0xf5+0x8a+0xfa+0x26+longlen;
				rt_kprintf("command is \r\n");
				for(i=0;i<data_len;i++)
				{
					rt_kprintf("%2x ",ptr[i]);	
					verify+=ptr[i];
				}
				rt_kprintf("crc is %2x %2x,verify is %x\r\n",crc[0],crc[1],verify);
				if(verify!=(crc[0]<<8|crc[1]))
				{
					rt_device_write(common_dev[dev], 0, (void *)COMMAND_FAIL, strlen(COMMAND_FAIL));
				}
				else
				{
					rt_device_write(common_dev[dev], 0, (void *)COMMAND_OK, strlen(COMMAND_OK));
					set_config(ptr,longlen,dev);					
				}
				state=GET_F5;
				break;
			}
		}
		else
		{
			while(rt_device_read(common_dev[dev], 0, &ch, 1)==1);
			state=GET_F5;			
			break;
		}
	}
		else
			{
				rt_thread_delay(1);
				delay++;
				if(delay>10)
					break;
			}
	}
	configunlock();
	return ;
}
#endif

static bool flag_cnn[4]={false,false,false,false};
void all_cut()
{
	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
	MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0); 
	MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0); 
	flag_cnn[0]=false;
	flag_cnn[1]=false;
	flag_cnn[2]=false;
	flag_cnn[3]=false;
}
void cnn_out(int index,int level)
{
	
	
	if(phy_link)
	{
		if(level&&(flag_cnn[index]==false))
			flag_cnn[index]=true;
		else if(!level&&(flag_cnn[index]==true))
			flag_cnn[index]=false;
		else
			return;
		rt_kprintf("dev %d , level %d, phy_link %d\r\n",index,level,phy_link);
		switch(index)
		{
			case 0:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);
				else
					MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);
				break;
			case 1:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,GPIO_PIN_5);
				else
					MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
				break;
			case 2:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,GPIO_PIN_2);
				else
					MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
				break;
			case 3:
				if(level)
				;//	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);
				else
				;//	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);	
				break;
			default:
				break;
		}
	}
	else
	{
		MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
		MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
		MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
		flag_cnn[0]=false;
		flag_cnn[1]=false;
		flag_cnn[2]=false;
		flag_cnn[3]=false;
		//MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);	
	}
}
int baud(int type)
{
	rt_kprintf("input baud %d\r\n",type);
	switch(type)
	{
		case 0:
			return 115200;
		case 1:
			return 128000;
		case 2:
			return 256000;
		case 3:
			return 460800;
		case 4:
			return 921600;
		case 5:
			return 1000000;
		case 6:
			return 2000000;
		case 7:
			return 4000000;
		case 8:
			return 6000000;
		}
	return 0;
}
void print_config(config g)
{
	rt_kprintf("\n============================================================================>\r\n");
	rt_kprintf("local_ip :\t%s\r\n",g.local_ip);
	rt_kprintf("local_ip6 :\t%s\r\n",g.local_ip6);
	rt_kprintf("local_port0 :\t%d\r\n",g.local_port[0]);
	rt_kprintf("local_port1 :\t%d\r\n",g.local_port[1]);
	rt_kprintf("local_port2 :\t%d\r\n",g.local_port[2]);
	rt_kprintf("local_port3 :\t%d\r\n",g.local_port[3]);
	rt_kprintf("sub_msk :\t%s\r\n",g.sub_msk);
	rt_kprintf("gw :\t%s\r\n",g.gw);
	rt_kprintf("mac :\t%s\r\n",g.mac);
	rt_kprintf("remote_ip0 :\t%s\r\n",g.remote_ip[0]);
	rt_kprintf("remote_ip1 :\t%s\r\n",g.remote_ip[1]);
	rt_kprintf("remote_ip2 :\t%s\r\n",g.remote_ip[2]);
	rt_kprintf("remote_ip3 :\t%s\r\n",g.remote_ip[3]);
	rt_kprintf("remote_ip60 :\t%s\r\n",g.remote_ip6[0]);
	rt_kprintf("remote_ip61 :\t%s\r\n",g.remote_ip6[1]);
	rt_kprintf("remote_ip62 :\t%s\r\n",g.remote_ip6[2]);
	rt_kprintf("remote_ip63 :\t%s\r\n",g.remote_ip6[3]);
	rt_kprintf("remote_port0 :\t%d\r\n",g.remote_port[0]);
	rt_kprintf("remote_port1 :\t%d\r\n",g.remote_port[1]);
	rt_kprintf("remote_port2 :\t%d\r\n",g.remote_port[2]);
	rt_kprintf("remote_port3 :\t%d\r\n",g.remote_port[3]);
	rt_kprintf("IP==>\tv4_v6\r\nsocket0 :\t%s\r\nsocket1 :\t%s\r\nsocket2 :\t%s\r\nsocket3 :\t%s\r\n",((g.config[0]&0x01)==0)?"IPV4":"IPV6",((g.config[1]&0x01)==0)?"IPV4":"IPV6",((g.config[2]&0x01)==0)?"IPV4":"IPV6",((g.config[3]&0x01)==0)?"IPV4":"IPV6");
	rt_kprintf("protol==>\tudp_tcp\r\nsocket0 :\t%s\r\nsocket1 :\t%s\r\nsocket2 :\t%s\r\nsocket3 :\t%s\r\n",((g.config[0]&0x02)==0x02)?"TCP":"UDP",((g.config[1]&0x02)==0x02)?"TCP":"UDP",((g.config[2]&0x02)==0x02)?"TCP":"UDP",((g.config[3]&0x02)==0x02)?"TCP":"UDP");
	rt_kprintf("mode==>\tclient_server\r\nsocket0 :\t%s\r\nsocket1 :\t%s\r\nsocket2 :\t%s\r\nsocket3 :\t%s\r\n",((g.config[0]&0x04)==0x04)?"SERVER":"CLIENT",((g.config[1]&0x04)==0x04)?"SERVER":"CLIENT",((g.config[2]&0x04)==0x04)?"SERVER":"CLIENT",((g.config[3]&0x04)==0x04)?"SERVER":"CLIENT");
	rt_kprintf("baud :\t%d.%d.%d.%d\r\n",baud((g.config[0]&0xf8)>>3),baud((g.config[1]&0xf8)>>3),baud((g.config[2]&0xf8)>>3),baud((g.config[3]&0xf8)>>3));
	rt_kprintf("\n============================================================================>\r\n");
}
int common_w_socket(int dev)
{	
	int len;
	rt_uint8_t /*common_buf[2048],*/*ptr;
	if(phy_link&&g_socket[dev].connected)
	{
		ptr=rt_malloc(256);
		len=rt_device_read(common_dev[dev], 0, ptr, 256);
		if(phy_link&&(len>0)&&g_socket[dev].connected)
		{
			#if !TEST_SOCKET
			t_len+=len;
			if(t_len<=100)
			#endif
			rt_data_queue_push(&g_data_queue[dev*2], ptr, len, RT_WAITING_FOREVER);	
			#if !TEST_SOCKET
			else
				rt_free(ptr);
			#endif
		}
		else
			rt_free(ptr);
	}
	return 0;
}
static rt_err_t common_rx_ind(rt_device_t dev, rt_size_t size)
{
    /* release semaphore to let finsh thread rx data */
	//DBG("dev %d common_rx_ind %d\r\n",which_common_dev(common_dev,dev),size);
    rt_sem_release(&(rx_sem[which_common_dev(common_dev,dev)]));
    return RT_EOK;
}

void common_w(void* parameter)
{
	int dev=((int)parameter)/2;
	static int flag[4]={0,0,0,0};
	DBG("common_w %d Enter\r\n",dev);
	while (1)
	{
		/* wait receive */
		if (rt_sem_take(&(rx_sem[dev]), RT_WAITING_FOREVER) != RT_EOK) continue;
		//DBG("to read in_low %d\r\n",ind_low(dev));
		if(ind[dev])
		{	
			//DBG("dev %d in socket data flag %d\n",dev,flag);
			if(flag[dev]==1)
			{
				print_config(g_conf);
				flag[dev]=0;	
				void *ptr1=(void *)&g_confb;
				void *ptr2=(void *)&g_conf;
				if(rt_memcmp(ptr1,ptr2,sizeof(config))!=0)
				{
					print_config(g_conf);
				}
			}
			
